set_device -family {PolarFire} -die {MPF300T} -speed {-1}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/ResetSycnc.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/MasterAddressDecoder.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/DependenceChecker.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/BitScan0.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/TransactionController.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/MasterControl.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/RoundRobinArb.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/TargetMuxController.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/AddressController.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/Revision.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/DERR_Slave.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/DualPort_Ram_SyncWr_SyncRd.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/DualPort_FF_SyncWr_SyncRd.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/RdFifoDualPort.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/ReadDataMux.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/RequestQual.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/ReadDataController.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/RDataController.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/SlaveDataMuxController.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/RespController.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/FifoDualPort.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/WriteDataMux.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/WDataController.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4CrossBar/Axi4CrossBar.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/AHB_SM.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/MstrAHBtoAXI4Converter.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/Bin2Gray.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/CDC_grayCodeCounter.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/CDC_rdCtrl.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/CDC_wrCtrl.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/RAM_BLOCK.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/CDC_FIFO.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/MstrClockDomainCrossing.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/DWC_DownConv_CmdFifoWriteCtrl.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/Axi4Convertors/Hold_Reg_Ctrl.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/Axi4Convertors/DWC_DownConv_Hold_Reg_Rd.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/DWC_DownConv_preCalcCmdFifoWrCtrl.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/DWC_DownConv_widthConvrd.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/FIFO_CTRL.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/FIFO.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/byte2bit.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/DWC_DownConv_readWidthConv.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/Axi4Convertors/DWC_DownConv_Hold_Reg_Wr.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/DWC_DownConv_widthConvwr.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/DWC_brespCtrl.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/DWC_DownConv_writeWidthConv.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/DownConverter.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/DWC_UpConv_AChannel.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/DWC_UpConv_BChannel.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/DWC_UpConv_RChan_Ctrl.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/DWC_UpConv_preCalcRChan_Ctrl.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/FIFO_downsizing.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/DWC_UpConv_RChannel.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/DWC_UpConv_WChan_Hold_Reg.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/DWC_UpConv_WChan_ReadDataFifoCtrl.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/DWC_UpConv_Wchan_WriteDataFifoCtrl.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/FIFO_upsizing.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/DWC_UpConv_WChannel.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/DWC_UpConv_preCalcAChannel.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/UpConverter.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/MstrDataWidthConv.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/MstrProtocolConverter.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/RegSliceFull.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/RegisterSlice.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/MasterConvertor.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/SlvClockDomainCrossing.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/SlvDataWidthConverter.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/SlvAxi4ProtConvAXI4ID.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/SlvAxi4ProtConvRead.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/SlvAxi4ProtConvWrite.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/SlvAxi4ProtocolConv.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/SlvProtocolConverter.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/Axi4Convertors/SlaveConvertor.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4INTERCONNECT/2.5.100/rtl/vlog/core/CoreAxi4Interconnect.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/AXI4_Interconnect/AXI4_Interconnect.v}
read_verilog -mode system_verilog -lib COREAHBTOAPB3_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAHBTOAPB3/3.2.101/rtl/vlog/core/coreahbtoapb3_ahbtoapbsm.v}
read_verilog -mode system_verilog -lib COREAHBTOAPB3_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAHBTOAPB3/3.2.101/rtl/vlog/core/coreahbtoapb3_apbaddrdata.v}
read_verilog -mode system_verilog -lib COREAHBTOAPB3_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAHBTOAPB3/3.2.101/rtl/vlog/core/coreahbtoapb3_penablescheduler.v}
read_verilog -mode system_verilog -lib COREAHBTOAPB3_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAHBTOAPB3/3.2.101/rtl/vlog/core/coreahbtoapb3.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/AHBtoAPB/AHBtoAPB.v}
read_verilog -mode system_verilog -lib COREAXITOAHBL_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXITOAHBL/3.3.102/rtl/vlog/core/CoreAXItoAHBL_AXIOutReg.v}
read_verilog -mode system_verilog -lib COREAXITOAHBL_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXITOAHBL/3.3.102/rtl/vlog/core/CoreAXItoAHBL_WSTRBAddrOffset.v}
read_verilog -mode system_verilog -lib COREAXITOAHBL_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXITOAHBL/3.3.102/rtl/vlog/core/CoreAXItoAHBL_WSTRBPopCntr.v}
read_verilog -mode system_verilog -lib COREAXITOAHBL_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXITOAHBL/3.3.102/rtl/vlog/core/CoreAXItoAHBL_readByteCnt.v}
read_verilog -mode system_verilog -lib COREAXITOAHBL_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXITOAHBL/3.3.102/rtl/vlog/core/CoreAXItoAHBL_AXISlaveCtrl.v}
read_verilog -mode system_verilog -lib COREAXITOAHBL_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXITOAHBL/3.3.102/rtl/vlog/core/CoreAXItoAHBL_RAM_syncWrAsyncRd.v}
read_verilog -mode system_verilog -lib COREAXITOAHBL_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXITOAHBL/3.3.102/rtl/vlog/core/CoreAXItoAHBL_synchronizer.v}
read_verilog -mode system_verilog -lib COREAXITOAHBL_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXITOAHBL/3.3.102/rtl/vlog/core/CoreAXItoAHBL_AHBMasterCtrl.v}
read_verilog -mode system_verilog -lib COREAXITOAHBL_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/AXItoAHBL/AXItoAHBL_0/rtl/vlog/core/CoreAXItoAHBL.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/AXItoAHBL/AXItoAHBL.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/CoreAHBLite/5.4.102/rtl/vlog/core/coreahblite_slavearbiter.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/CoreAHBLite/5.4.102/rtl/vlog/core/coreahblite_slavestage.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/CoreAHBLite/5.4.102/rtl/vlog/core/coreahblite_defaultslavesm.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/CoreAHBLite/5.4.102/rtl/vlog/core/coreahblite_addrdec.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/CoreAHBLite/5.4.102/rtl/vlog/core/coreahblite_masterstage.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/CoreAHBLite/5.4.102/rtl/vlog/core/coreahblite_matrix4x16.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/Core_AHBL/Core_AHBL_0/rtl/vlog/core/coreahblite.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/Core_AHBL/Core_AHBL.v}
read_verilog -mode system_verilog -lib COREAPB3_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/CoreAPB3/4.2.100/rtl/vlog/core/coreapb3_muxptob3.v}
read_verilog -mode system_verilog -lib COREAPB3_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/CoreAPB3/4.2.100/rtl/vlog/core/coreapb3_iaddr_reg.v}
read_verilog -mode system_verilog -lib COREAPB3_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/CoreAPB3/4.2.100/rtl/vlog/core/coreapb3.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/Core_APB/Core_APB.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/AXItoAPB/AXItoAPB.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/CCC_111MHz/CCC_111MHz_0/CCC_111MHz_CCC_111MHz_0_PF_CCC.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/CCC_111MHz/CCC_111MHz.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/CoreAXI4_Lite/CoreAXI4_Lite.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_axi4_lite_slave_ctrl.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_ctrl_if_mux_cdc.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_axi4_stream_slave_ctrl.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_control_registers.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_int_controller_fifo.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_int_x_ctrl.v}
 add_include_path  {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/CoreDMA_Controller/CoreDMA_Controller_0}
 add_include_path  {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/CoreDMA_Controller/CoreDMA_Controller_0}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/CoreDMA_Controller/CoreDMA_Controller_0/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_int_controller.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_axi4_master_ctrl.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_cache.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_round_robin_arbiter_w_ack.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_dma_start_ctrl.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_int_status_mux.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_round_robin_arbiter.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_fixed_priority_arbiter.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_int_ext_dscrptr_cache.v}
 add_include_path  {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/CoreDMA_Controller/CoreDMA_Controller_0}
 add_include_path  {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/CoreDMA_Controller/CoreDMA_Controller_0}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/CoreDMA_Controller/CoreDMA_Controller_0/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_dma_arbiter.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_dscrptr_src_mux.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_trans_ack.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_wr_tran_queue.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_rd_tran_queue.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_wr_tran_ctrl.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_int_error_ctrl_fsm.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_rd_tran_ctrl.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_dma_tran_ctrl.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_ext_dscrptr_fetch_fsm.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_dma_controller.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_ram_1k20_wrapper.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREAXI4DMACONTROLLER/2.0.100/rtl/vlog/core_obfuscated/coreaxi4dmacontroller_buffer_descriptors.v}
read_verilog -mode system_verilog -lib COREAXI4DMACONTROLLER_LIB {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/CoreDMA_Controller/CoreDMA_Controller_0/rtl/vlog/core_obfuscated/coreaxi4dmacontroller.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/CoreDMA_Controller/CoreDMA_Controller.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/Core_UART/Core_UART_0/rtl/vlog/core/Clock_gen.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/Core_UART/Core_UART_0/rtl/vlog/core/Rx_async.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/Core_UART/Core_UART_0/rtl/vlog/core/Tx_async.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/Core_UART/Core_UART_0/rtl/vlog/core/fifo_256x8_g5.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/Core_UART/Core_UART_0/rtl/vlog/core/CoreUART.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/Core_UART/Core_UART.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/hdl/CMD_CTRLR.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/tpsram/tpsram_0/tpsram_tpsram_0_PF_TPSRAM.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/tpsram/tpsram.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/hdl/PATTERN_GEN_CHECKER.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/UART_SD/UART_SD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/hdl/AXI4DMA_INIT.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/hdl/AXI_IO_CTRL.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/CoreDMA_IO_CTRL/CoreDMA_IO_CTRL.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PCIe_EP/PCIe_REF_CLK_0/PCIe_EP_PCIe_REF_CLK_0_PF_XCVR_REF_CLK.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/SgCore/PF_PCIE/2.0.116/g5_apblink_master.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PCIe_EP/PCIex4_0/PCIe_EP_PCIex4_0_PF_PCIE.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/CLK_DIV2/CLK_DIV2_0/CLK_DIV2_CLK_DIV2_0_PF_CLK_DIV.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/CLK_DIV2/CLK_DIV2.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/NGMUX/NGMUX_0/NGMUX_NGMUX_0_PF_NGMUX.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/NGMUX/NGMUX.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/OSC_160MHz/OSC_160MHz_0/OSC_160MHz_OSC_160MHz_0_PF_OSC.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/OSC_160MHz/OSC_160MHz.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PCIe_INIT_MONITOR/PCIe_INIT_MONITOR_0/PCIe_INIT_MONITOR_PCIe_INIT_MONITOR_0_PF_INIT_MONITOR.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PCIe_INIT_MONITOR/PCIe_INIT_MONITOR.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PCIe_TL_CLK/PCIe_TL_CLK.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PCIe_TX_PLL/PCIe_TX_PLL_0/PCIe_TX_PLL_PCIe_TX_PLL_0_PF_TX_PLL.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PCIe_TX_PLL/PCIe_TX_PLL.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/hdl/Debounce.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/hdl/SW_Debounce.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PCIe_EP/PCIe_EP.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS/CCC_0/PF_DDR3_SS_CCC_0_PF_CCC.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/IOD_A_11_0/PF_DDR3_SS_DDRPHY_BLK_IOD_A_11_0_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/IOD_A_12/PF_DDR3_SS_DDRPHY_BLK_IOD_A_12_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/IOD_A_13/PF_DDR3_SS_DDRPHY_BLK_IOD_A_13_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/IOD_A_14/PF_DDR3_SS_DDRPHY_BLK_IOD_A_14_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/IOD_A_15/PF_DDR3_SS_DDRPHY_BLK_IOD_A_15_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/IOD_BA/PF_DDR3_SS_DDRPHY_BLK_IOD_BA_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/IOD_BCLK_TRAINING/PF_DDR3_SS_DDRPHY_BLK_IOD_BCLK_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/IOD_CAS_N/PF_DDR3_SS_DDRPHY_BLK_IOD_CAS_N_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/IOD_CKE/PF_DDR3_SS_DDRPHY_BLK_IOD_CKE_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/IOD_CS_N/PF_DDR3_SS_DDRPHY_BLK_IOD_CS_N_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/IOD_ODT/PF_DDR3_SS_DDRPHY_BLK_IOD_ODT_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/IOD_RAS_N/PF_DDR3_SS_DDRPHY_BLK_IOD_RAS_N_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/IOD_REF_CLK_TRAINING/PF_DDR3_SS_DDRPHY_BLK_IOD_REF_CLK_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/IOD_RESET_N/PF_DDR3_SS_DDRPHY_BLK_IOD_RESET_N_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/IOD_WE_N/PF_DDR3_SS_DDRPHY_BLK_IOD_WE_N_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/LANECTRL_ADDR_CMD_0/PF_LANECTRL_PAUSE_SYNC.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/LANECTRL_ADDR_CMD_0/PF_DDR3_SS_DDRPHY_BLK_LANECTRL_ADDR_CMD_0_PF_LANECTRL.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/LANE_0_CTRL/PF_LANECTRL_PAUSE_SYNC.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/LANE_0_CTRL/PF_DDR3_SS_DDRPHY_BLK_LANE_0_CTRL_PF_LANECTRL.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/LANE_0_IOD_DM/PF_DDR3_SS_DDRPHY_BLK_LANE_0_IOD_DM_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/LANE_0_IOD_DQSW_TRAINING/PF_DDR3_SS_DDRPHY_BLK_LANE_0_IOD_DQSW_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/LANE_0_IOD_DQS/PF_DDR3_SS_DDRPHY_BLK_LANE_0_IOD_DQS_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/LANE_0_IOD_DQ/PF_DDR3_SS_DDRPHY_BLK_LANE_0_IOD_DQ_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/LANE_0_IOD_READ_TRAINING/PF_DDR3_SS_DDRPHY_BLK_LANE_0_IOD_READ_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/LANE_1_CTRL/PF_LANECTRL_PAUSE_SYNC.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/LANE_1_CTRL/PF_DDR3_SS_DDRPHY_BLK_LANE_1_CTRL_PF_LANECTRL.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/LANE_1_IOD_DM/PF_DDR3_SS_DDRPHY_BLK_LANE_1_IOD_DM_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/LANE_1_IOD_DQSW_TRAINING/PF_DDR3_SS_DDRPHY_BLK_LANE_1_IOD_DQSW_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/LANE_1_IOD_DQS/PF_DDR3_SS_DDRPHY_BLK_LANE_1_IOD_DQS_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/LANE_1_IOD_DQ/PF_DDR3_SS_DDRPHY_BLK_LANE_1_IOD_DQ_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/LANE_1_IOD_READ_TRAINING/PF_DDR3_SS_DDRPHY_BLK_LANE_1_IOD_READ_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/ddr_init_iterator.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/ram_simple_dp.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/FIFO_BLK.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/LANE_CTRL.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/LANE_ALIGNMENT.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/APB_IF.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/DLL_MON.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/flag_generator.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/trn_bclksclk.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/trn_cmdaddr.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/trn_dqsw.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/TRN_CLK.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/ddr4_vref.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/DELAY_CTRL.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/APB_IOG_CTRL_SM.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/IOG_IF.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/dq_align_dqs_optimization.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/gate_training.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/RDLVL_TRAIN.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/RDLVL_SMS.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/RDLVL.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/TRN_COMPLETE.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/VREF_TR.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/WRLVL_BOT.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/WRLVL.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/LEVELLING.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/PHY_SIG_MOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/write_callibrator.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/TIP_CTRL_BLK.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/register_bank.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/CoreDDR_TIP_INT.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/DirectCore/COREDDR_TIP/2.1.101/rtl/vlog/core/CoreDDR_TIP_SYN.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS_DDRPHY_BLK/PF_DDR3_SS_DDRPHY_BLK.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS/DLL_0/PF_DDR3_SS_DLL_0_PF_CCC.v}
 add_include_path  {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS/DDRCTRL_0}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS/DDRCTRL_0/CoreDDRMemCtrlr_1.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/Actel/SgCore/PF_DDR_CFG_INIT/1.0.100/cfg_init.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS/PF_DDR3_SS.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS/CCC_0/PF_DDR4_SS_CCC_0_PF_CCC.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/IOD_ACT_N/PF_DDR4_SS_DDRPHY_BLK_IOD_ACT_N_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/IOD_A_11_0/PF_DDR4_SS_DDRPHY_BLK_IOD_A_11_0_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/IOD_A_12/PF_DDR4_SS_DDRPHY_BLK_IOD_A_12_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/IOD_A_13/PF_DDR4_SS_DDRPHY_BLK_IOD_A_13_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/IOD_BA/PF_DDR4_SS_DDRPHY_BLK_IOD_BA_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/IOD_BCLK_TRAINING/PF_DDR4_SS_DDRPHY_BLK_IOD_BCLK_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/IOD_BG/PF_DDR4_SS_DDRPHY_BLK_IOD_BG_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/IOD_CAS_N/PF_DDR4_SS_DDRPHY_BLK_IOD_CAS_N_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/IOD_CKE/PF_DDR4_SS_DDRPHY_BLK_IOD_CKE_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/IOD_CS_N/PF_DDR4_SS_DDRPHY_BLK_IOD_CS_N_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/IOD_ODT/PF_DDR4_SS_DDRPHY_BLK_IOD_ODT_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/IOD_RAS_N/PF_DDR4_SS_DDRPHY_BLK_IOD_RAS_N_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/IOD_REF_CLK_TRAINING/PF_DDR4_SS_DDRPHY_BLK_IOD_REF_CLK_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/IOD_RESET_N/PF_DDR4_SS_DDRPHY_BLK_IOD_RESET_N_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/IOD_WE_N/PF_DDR4_SS_DDRPHY_BLK_IOD_WE_N_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/LANECTRL_ADDR_CMD_0/PF_LANECTRL_PAUSE_SYNC.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/LANECTRL_ADDR_CMD_0/PF_DDR4_SS_DDRPHY_BLK_LANECTRL_ADDR_CMD_0_PF_LANECTRL.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/LANE_0_CTRL/PF_LANECTRL_PAUSE_SYNC.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/LANE_0_CTRL/PF_DDR4_SS_DDRPHY_BLK_LANE_0_CTRL_PF_LANECTRL.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/LANE_0_IOD_DM/PF_DDR4_SS_DDRPHY_BLK_LANE_0_IOD_DM_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/LANE_0_IOD_DQSW_TRAINING/PF_DDR4_SS_DDRPHY_BLK_LANE_0_IOD_DQSW_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/LANE_0_IOD_DQS/PF_DDR4_SS_DDRPHY_BLK_LANE_0_IOD_DQS_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/LANE_0_IOD_DQ/PF_DDR4_SS_DDRPHY_BLK_LANE_0_IOD_DQ_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/LANE_0_IOD_READ_TRAINING/PF_DDR4_SS_DDRPHY_BLK_LANE_0_IOD_READ_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/LANE_1_CTRL/PF_LANECTRL_PAUSE_SYNC.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/LANE_1_CTRL/PF_DDR4_SS_DDRPHY_BLK_LANE_1_CTRL_PF_LANECTRL.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/LANE_1_IOD_DM/PF_DDR4_SS_DDRPHY_BLK_LANE_1_IOD_DM_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/LANE_1_IOD_DQSW_TRAINING/PF_DDR4_SS_DDRPHY_BLK_LANE_1_IOD_DQSW_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/LANE_1_IOD_DQS/PF_DDR4_SS_DDRPHY_BLK_LANE_1_IOD_DQS_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/LANE_1_IOD_DQ/PF_DDR4_SS_DDRPHY_BLK_LANE_1_IOD_DQ_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/LANE_1_IOD_READ_TRAINING/PF_DDR4_SS_DDRPHY_BLK_LANE_1_IOD_READ_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS_DDRPHY_BLK/PF_DDR4_SS_DDRPHY_BLK.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS/DLL_0/PF_DDR4_SS_DLL_0_PF_CCC.v}
 add_include_path  {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS/DDRCTRL_0}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS/DDRCTRL_0/CoreDDRMemCtrlr_0.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS/PF_DDR4_SS.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_RESET/PF_RESET_0/core/corereset_pf.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_RESET/PF_RESET.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/SRAM_AXI/PF_TPSRAM_AHB_AXI_0/SRAM_AXI_PF_TPSRAM_AHB_AXI_0_PF_TPSRAM.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/SRAM_AXI/COREAXI4SRAM_0/rtl/vlog/core/CoreAXI4SRAM_MAINCTRL_ECC.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/SRAM_AXI/COREAXI4SRAM_0/rtl/vlog/core/CoreAXI4SRAM_MAINCTRL.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/SRAM_AXI/COREAXI4SRAM_0/rtl/vlog/core/CoreAXI4SRAM_SLVIF.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/SRAM_AXI/COREAXI4SRAM_0/rtl/vlog/core/CoreAXI4SRAM.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/SRAM_AXI/SRAM_AXI.v}
read_verilog -mode system_verilog {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PCIe_EP_Demo/PCIe_EP_Demo.v}
set_top_level {PCIe_EP_Demo}
read_sdc -component {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/CCC_111MHz/CCC_111MHz_0/CCC_111MHz_CCC_111MHz_0_PF_CCC.sdc}
read_sdc -component {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/CLK_DIV2/CLK_DIV2_0/CLK_DIV2_CLK_DIV2_0_PF_CLK_DIV.sdc}
read_sdc -component {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PCIe_TX_PLL/PCIe_TX_PLL_0/PCIe_TX_PLL_PCIe_TX_PLL_0_PF_TX_PLL.sdc}
read_sdc -component {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS/PF_DDR3_SS.sdc}
read_sdc -component {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS/CCC_0/PF_DDR3_SS_CCC_0_PF_CCC.sdc}
read_sdc -component {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR3_SS/DLL_0/PF_DDR3_SS_DLL_0_PF_CCC.sdc}
read_sdc -component {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS/PF_DDR4_SS.sdc}
read_sdc -component {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS/CCC_0/PF_DDR4_SS_CCC_0_PF_CCC.sdc}
read_sdc -component {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PF_DDR4_SS/DLL_0/PF_DDR4_SS_DLL_0_PF_CCC.sdc}
read_sdc -component {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/component/work/PCIe_EP/PCIex4_0/PCIe_EP_PCIex4_0_PF_PCIE.sdc}
derive_constraints
write_sdc {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/constraint/PCIe_EP_Demo_derived_constraints.sdc}
write_ndc {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/constraint/PCIe_EP_Demo_derived_constraints.ndc}
write_pdc {/sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/constraint/fp/PCIe_EP_Demo_derived_constraints.pdc}
