#create_clock -name {CLK_0} -period 20 -waveform {0 10 } [ get_ports { CLK_0 } ]
#create_clock -name {CLK_1} -period 10 -waveform {0 5 } [ get_ports { CLK_1 } ]
#create_generated_clock -name {new_CLK0} -divide_by 2 -source [ get_ports { CLK_0 } ] [ get_pins { DFN1_0/Q } ]
#set_multicycle_path -setup 4 -from [ get_clocks { CLK_0 } ] -to [ get_ports { Q_0 } ]
#set_multicycle_path -hold 2 -from [ get_clocks { CLK_0 } ] -to [ get_ports { Q_0 } ]
#set_clock_latency -source -rise -late 0.01 [ get_clocks { CLK_0 } ]
#set_clock_latency -source -rise -early 0.01 [ get_clocks { CLK_0 } ]
#set_clock_latency -source -fall -late 0.01 [ get_clocks { CLK_0 } ]
#set_clock_latency -source -fall -early 0.01 [ get_clocks { CLK_0 } ]
