set_device -family {PolarFire} -die {MPF300T}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\hdl\debounce.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\hdl\prbscheck_parallel_fab.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\hdl\prbsgen_parallel_fab.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\hdl\rev_bits.v}
read_verilog -mode system_verilog -lib CORERXIODBITALIGN_LIB {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\CORERXIODBITALIGN_C0\CORERXIODBITALIGN_C0_0\rtl\vlog\core\CoreRxIODBitAlign.v}
read_verilog -mode system_verilog -lib CORERXIODBITALIGN_LIB {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\CORERXIODBITALIGN_C0\CORERXIODBITALIGN_C0_0\rtl\vlog\core\CoreRxIODBitAlign_top.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\CORERXIODBITALIGN_C0\CORERXIODBITALIGN_C0.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_CCC_C0\PF_CCC_C0_0\PF_CCC_C0_PF_CCC_C0_0_PF_CCC.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_CCC_C0\PF_CCC_C0.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_GENERIC_RX_C1\PF_CLK_DIV_FIFO\PF_IOD_GENERIC_RX_C1_PF_CLK_DIV_FIFO_PF_CLK_DIV_DELAY.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_GENERIC_RX_C1\PF_CLK_DIV_RXCLK\PF_IOD_GENERIC_RX_C1_PF_CLK_DIV_RXCLK_PF_CLK_DIV_DELAY.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_GENERIC_RX_C1\PF_IOD_CLK_TRAINING\PF_IOD_GENERIC_RX_C1_PF_IOD_CLK_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_GENERIC_RX_C1\PF_IOD_RX\PF_IOD_GENERIC_RX_C1_PF_IOD_RX_PF_IOD.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_GENERIC_RX_C1\PF_LANECTRL_0\PF_LANECTRL_PAUSE_SYNC.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_GENERIC_RX_C1\PF_LANECTRL_0\PF_IOD_GENERIC_RX_C1_PF_LANECTRL_0_PF_LANECTRL.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\Actel\DirectCore\COREBCLKSCLKALIGN\2.0.111\rtl\vlog\core\PLL_BclkSclkAlign.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\Actel\DirectCore\COREBCLKSCLKALIGN\2.0.111\rtl\vlog\core\ICB_BclkSclkAlign.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_GENERIC_RX_C1_TR\PF_IOD_GENERIC_RX_C1_TR_0\rtl\vlog\core\CoreBclkSclkAlign.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_GENERIC_RX_C1_TR\PF_IOD_GENERIC_RX_C1_TR.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_GENERIC_RX_C1\PF_IOD_GENERIC_RX_C1.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_GENERIC_TX_C0\LANECTRL_ADDR_CMD_0\PF_LANECTRL_PAUSE_SYNC.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_GENERIC_TX_C0\LANECTRL_ADDR_CMD_0\PF_IOD_GENERIC_TX_C0_LANECTRL_ADDR_CMD_0_PF_LANECTRL.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_GENERIC_TX_C0\PF_IOD_CLK_TRAINING\PF_IOD_GENERIC_TX_C0_PF_IOD_CLK_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_GENERIC_TX_C0\PF_IOD_TX_CLK\PF_IOD_GENERIC_TX_C0_PF_IOD_TX_CLK_PF_IOD.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_GENERIC_TX_C0\PF_IOD_TX\PF_IOD_GENERIC_TX_C0_PF_IOD_TX_PF_IOD.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_GENERIC_TX_C0\PF_IOD_GENERIC_TX_C0.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_TX_CCC_C0\PF_CCC_0\PF_IOD_TX_CCC_C0_PF_CCC_0_PF_CCC.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_TX_CCC_C0_TR\PF_IOD_TX_CCC_C0_TR_0\rtl\vlog\core\CoreBclkSclkAlign.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_TX_CCC_C0_TR\PF_IOD_TX_CCC_C0_TR.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_TX_CCC_C0\PF_IOD_TX_CCC_C0.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_OSC_C1\PF_OSC_C1_0\PF_OSC_C1_PF_OSC_C1_0_PF_OSC.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_OSC_C1\PF_OSC_C1.v}
read_verilog -mode system_verilog {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\IOG_IOD_DDRX4_COMP\IOG_IOD_DDRX4_COMP.v}
set_top_level {IOG_IOD_DDRX4_COMP}
read_sdc -component {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\CORERXIODBITALIGN_C0\CORERXIODBITALIGN_C0_0\CORERXIODBITALIGN_C0.sdc}
read_sdc -component {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\IOG_IOD_CLOCK\IOG_IOD_CLOCK_0\IOG_IOD_CLOCK_IOG_IOD_CLOCK_0_PF_CCC.sdc}
read_sdc -component {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_CCC_C0\PF_CCC_C0_0\PF_CCC_C0_PF_CCC_C0_0_PF_CCC.sdc}
read_sdc -component {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_GENERIC_RX_C1\PF_CLK_DIV_FIFO\PF_IOD_GENERIC_RX_C1_PF_CLK_DIV_FIFO_PF_CLK_DIV_DELAY.sdc}
read_sdc -component {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_GENERIC_RX_C1\PF_CLK_DIV_RXCLK\PF_IOD_GENERIC_RX_C1_PF_CLK_DIV_RXCLK_PF_CLK_DIV_DELAY.sdc}
read_sdc -component {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_GENERIC_RX_C1\PF_IOD_GENERIC_RX_C1.sdc}
read_sdc -component {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_GENERIC_RX_C1_TR\PF_IOD_GENERIC_RX_C1_TR_0\PF_IOD_GENERIC_RX_C1_TR.sdc}
read_sdc -component {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_GENERIC_TX_C0\PF_IOD_GENERIC_TX_C0.sdc}
read_sdc -component {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_TX_CCC_C0\PF_CCC_0\PF_IOD_TX_CCC_C0_PF_CCC_0_PF_CCC.sdc}
read_sdc -component {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_TX_CCC_C0\PF_IOD_TX_CCC_C0.sdc}
read_sdc -component {E:\saikiran_sn\TC\IOD\IOD_2bit\component\work\PF_IOD_TX_CCC_C0_TR\PF_IOD_TX_CCC_C0_TR_0\PF_IOD_TX_CCC_C0_TR.sdc}
derive_constraints
write_sdc {E:\saikiran_sn\TC\IOD\IOD_2bit\constraint\IOG_IOD_DDRX4_COMP_derived_constraints.sdc}
write_pdc {E:\saikiran_sn\TC\IOD\IOD_2bit\constraint\fp\IOG_IOD_DDRX4_COMP_derived_constraints.pdc}
