# Microsemi Corp.
# Date: 2022-May-17 09:35:55
# This file was generated based on the following SDC source files:
#   /sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/constraint/PCIe_EP_Demo_derived_constraints.sdc
#   /sqahyd/Pramod/Github_Examples/SmartDebug_PCIe_Register_read/PCIe_Register_Read/constraint/timing_user_constraints.sdc
#

create_clock -name {REF_CLK_0} -period 20 [ get_ports { REF_CLK_0 } ]
create_clock -name {REF_CLK_PAD_P} -period 10 [ get_ports { REF_CLK_PAD_P } ]
create_clock -name {PCIe_EP_0/PCIe_TX_PLL_0/PCIe_TX_PLL_0/txpll_isnt_0/DIV_CLK} -period 8 [ get_pins { PCIe_EP_0/PCIe_TX_PLL_0/PCIe_TX_PLL_0/txpll_isnt_0/DIV_CLK } ]
create_clock -name {PCIe_EP_0/PCIe_TL_CLK_0/OSC_160MHz_0/OSC_160MHz_0/I_OSC_160/CLK} -period 6.25 [ get_pins { PCIe_EP_0/PCIe_TL_CLK_0/OSC_160MHz_0/OSC_160MHz_0/I_OSC_160/CLK } ]
create_generated_clock -name {CCC_111MHz_0/CCC_111MHz_0/pll_inst_0/OUT0} -multiply_by 20 -divide_by 9 -source [ get_pins { CCC_111MHz_0/CCC_111MHz_0/pll_inst_0/REF_CLK_0 } ] -phase 0 [ get_pins { CCC_111MHz_0/CCC_111MHz_0/pll_inst_0/OUT0 } ]
create_generated_clock -name {PCIe_EP_0/PCIe_TL_CLK_0/CLK_DIV2_0/CLK_DIV2_0/I_CD/Y_DIV} -divide_by 2 -source [ get_pins { PCIe_EP_0/PCIe_TL_CLK_0/CLK_DIV2_0/CLK_DIV2_0/I_CD/A } ] [ get_pins { PCIe_EP_0/PCIe_TL_CLK_0/CLK_DIV2_0/CLK_DIV2_0/I_CD/Y_DIV } ]
create_generated_clock -name {PF_DDR3_SS_0/CCC_0/pll_inst_0/OUT0} -multiply_by 6 -source [ get_pins { PF_DDR3_SS_0/CCC_0/pll_inst_0/REF_CLK_0 } ] -phase 0 [ get_pins { PF_DDR3_SS_0/CCC_0/pll_inst_0/OUT0 } ]
create_generated_clock -name {PF_DDR3_SS_0/CCC_0/pll_inst_0/OUT1} -multiply_by 3 -divide_by 2 -source [ get_pins { PF_DDR3_SS_0/CCC_0/pll_inst_0/REF_CLK_0 } ] -phase 0 [ get_pins { PF_DDR3_SS_0/CCC_0/pll_inst_0/OUT1 } ]
create_generated_clock -name {PF_DDR3_SS_0/CCC_0/pll_inst_0/OUT2} -multiply_by 6 -source [ get_pins { PF_DDR3_SS_0/CCC_0/pll_inst_0/REF_CLK_0 } ] -phase 0 [ get_pins { PF_DDR3_SS_0/CCC_0/pll_inst_0/OUT2 } ]
create_generated_clock -name {PF_DDR3_SS_0/CCC_0/pll_inst_0/OUT3} -multiply_by 6 -source [ get_pins { PF_DDR3_SS_0/CCC_0/pll_inst_0/REF_CLK_0 } ] -phase 0 [ get_pins { PF_DDR3_SS_0/CCC_0/pll_inst_0/OUT3 } ]
create_generated_clock -name {PF_DDR4_SS_0/CCC_0/pll_inst_0/OUT0} -multiply_by 16 -source [ get_pins { PF_DDR4_SS_0/CCC_0/pll_inst_0/REF_CLK_0 } ] -phase 0 [ get_pins { PF_DDR4_SS_0/CCC_0/pll_inst_0/OUT0 } ]
create_generated_clock -name {PF_DDR4_SS_0/CCC_0/pll_inst_0/OUT1} -multiply_by 4 -source [ get_pins { PF_DDR4_SS_0/CCC_0/pll_inst_0/REF_CLK_0 } ] -phase 0 [ get_pins { PF_DDR4_SS_0/CCC_0/pll_inst_0/OUT1 } ]
create_generated_clock -name {PF_DDR4_SS_0/CCC_0/pll_inst_0/OUT2} -multiply_by 16 -source [ get_pins { PF_DDR4_SS_0/CCC_0/pll_inst_0/REF_CLK_0 } ] -phase 0 [ get_pins { PF_DDR4_SS_0/CCC_0/pll_inst_0/OUT2 } ]
create_generated_clock -name {PF_DDR4_SS_0/CCC_0/pll_inst_0/OUT3} -multiply_by 16 -source [ get_pins { PF_DDR4_SS_0/CCC_0/pll_inst_0/REF_CLK_0 } ] -phase 0 [ get_pins { PF_DDR4_SS_0/CCC_0/pll_inst_0/OUT3 } ]
set_false_path -to [ get_pins { PCIe_EP_0/PCIex4_0/PCIE_1/INTERRUPT[0] PCIe_EP_0/PCIex4_0/PCIE_1/INTERRUPT[1] PCIe_EP_0/PCIex4_0/PCIE_1/INTERRUPT[2] PCIe_EP_0/PCIex4_0/PCIE_1/INTERRUPT[3] PCIe_EP_0/PCIex4_0/PCIE_1/INTERRUPT[4] PCIe_EP_0/PCIex4_0/PCIE_1/INTERRUPT[5] PCIe_EP_0/PCIex4_0/PCIE_1/INTERRUPT[6] PCIe_EP_0/PCIex4_0/PCIE_1/INTERRUPT[7] PCIe_EP_0/PCIex4_0/PCIE_1/WAKEREQ PCIe_EP_0/PCIex4_0/PCIE_1/MPERST_N } ]
set_false_path -from [ get_pins { PCIe_EP_0/PCIex4_0/PCIE_1/TL_CLK } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/*/I_IOD_*/ARST_N } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_*_CTRL/I_LANECTRL/HS_IO_CLK_PAUSE } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANECTRL_ADDR_CMD_0/I_LANECTRL*/HS_IO_CLK_PAUSE } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/*/I_IOD_*/RX_SYNC_RST* } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/*/I_IOD_*/DELAY_LINE_MOVE } ]
set_false_path -through [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/*/I_IOD_*/DELAY_LINE_OUT_OF_RANGE } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DDR_READ } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/RESET } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DELAY_LINE_DIRECTION } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DELAY_LINE_MOVE } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DELAY_LINE_LOAD PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DELAY_LINE_SEL } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/SWITCH } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/READ_CLK_SEL[2] } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[0] } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[1] } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[2] } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[3] } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[4] } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[5] } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[6] } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[7] } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DDR_READ } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/RESET } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DELAY_LINE_DIRECTION } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DELAY_LINE_MOVE } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DELAY_LINE_LOAD PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DELAY_LINE_SEL } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/SWITCH } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/READ_CLK_SEL[2] } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[0] } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[1] } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[2] } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[3] } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[4] } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[5] } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[6] } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[7] } ]
set_false_path -through [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/*/I_*FEEDBACK*/Y } ]
set_false_path -through [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/OB_DIFF_CK0/U_IOPADP/Y } ]
set_false_path -through [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/OB_A_12/U_IOPAD/Y } ]
set_false_path -through [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/*/I_TRIBUFF_*/D } ]
set_false_path -through [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/*/I_TRIBUFF_*/E } ]
set_false_path -through [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/*/I_BIBUF*/D } ]
set_false_path -through [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/*/I_BIBUF*/E } ]
set_false_path -through [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/*/I_BIBUF*/Y } ]
set_false_path -through [ get_pins { PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_1_IOD_DQS/I_BIBUF_DIFF_DQS_0/U_IOPADN/Y PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_1_IOD_DQS/I_BIBUF_DIFF_DQS_0/U_IOPADP/N2PIN_P PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_0_IOD_DQS/I_BIBUF_DIFF_DQS_0/U_IOPADP/N2PIN_P PF_DDR3_SS_0/DDRPHY_BLK_0/LANE_0_IOD_DQS/I_BIBUF_DIFF_DQS_0/U_IOPADN/Y } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/CCC_0/pll_inst_0/PHASE_OUT0_SEL } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/CCC_0/pll_inst_0/PHASE_OUT2_SEL } ]
set_false_path -to [ get_pins { PF_DDR3_SS_0/CCC_0/pll_inst_0/PHASE_OUT3_SEL } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/*/I_IOD_*/ARST_N } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_*_CTRL/I_LANECTRL/HS_IO_CLK_PAUSE } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANECTRL_ADDR_CMD_0/I_LANECTRL*/HS_IO_CLK_PAUSE } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/*/I_IOD_*/RX_SYNC_RST* } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/*/I_IOD_*/DELAY_LINE_MOVE } ]
set_false_path -through [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/*/I_IOD_*/DELAY_LINE_OUT_OF_RANGE } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DDR_READ } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/RESET } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DELAY_LINE_DIRECTION } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DELAY_LINE_MOVE } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DELAY_LINE_LOAD PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DELAY_LINE_SEL } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/SWITCH } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/READ_CLK_SEL[2] } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[0] } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[1] } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[2] } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[3] } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[4] } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[5] } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[6] } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_0_CTRL/I_LANECTRL/DLL_CODE[7] } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DDR_READ } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/RESET } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DELAY_LINE_DIRECTION } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DELAY_LINE_MOVE } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DELAY_LINE_LOAD PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DELAY_LINE_SEL } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/SWITCH } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/READ_CLK_SEL[2] } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[0] } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[1] } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[2] } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[3] } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[4] } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[5] } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[6] } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_1_CTRL/I_LANECTRL/DLL_CODE[7] } ]
set_false_path -through [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/*/I_*FEEDBACK*/Y } ]
set_false_path -through [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/OB_DIFF_CK0/U_IOPADP/Y } ]
set_false_path -through [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/OB_A_12/U_IOPAD/Y } ]
set_false_path -through [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/*/I_TRIBUFF_*/D } ]
set_false_path -through [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/*/I_TRIBUFF_*/E } ]
set_false_path -through [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/*/I_BIBUF*/D } ]
set_false_path -through [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/*/I_BIBUF*/E } ]
set_false_path -through [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/*/I_BIBUF*/Y } ]
set_false_path -through [ get_pins { PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_0_IOD_DQS/I_BIBUF_DIFF_DQS_0/U_IOPADP/N2PIN_P PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_0_IOD_DQS/I_BIBUF_DIFF_DQS_0/U_IOPADN/Y PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_1_IOD_DQS/I_BIBUF_DIFF_DQS_0/U_IOPADN/Y PF_DDR4_SS_0/DDRPHY_BLK_0/LANE_1_IOD_DQS/I_BIBUF_DIFF_DQS_0/U_IOPADP/N2PIN_P } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/CCC_0/pll_inst_0/PHASE_OUT0_SEL } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/CCC_0/pll_inst_0/PHASE_OUT2_SEL } ]
set_false_path -to [ get_pins { PF_DDR4_SS_0/CCC_0/pll_inst_0/PHASE_OUT3_SEL } ]
set_multicycle_path -setup_only 2 -from [ get_cells { PF_DDR3_SS_0/DDRPHY_BLK_0/IOD_TRAINING_0/COREDDR_TIP_INT_U/TIP_CTRL_BLK/u_write_callibrator/select* } ]
set_multicycle_path -setup_only 2 -from [ get_cells { PF_DDR4_SS_0/DDRPHY_BLK_0/IOD_TRAINING_0/COREDDR_TIP_INT_U/TIP_CTRL_BLK/u_write_callibrator/select* } ]
set_clock_jitter 0.15 [ get_clocks { PF_DDR4_SS_0/CCC_0/pll_inst_0/OUT3 } ]
set_clock_jitter 0.135 [ get_clocks { PF_DDR4_SS_0/CCC_0/pll_inst_0/OUT0 } ]
set_clock_jitter 0.15 [ get_clocks { PF_DDR3_SS_0/CCC_0/pll_inst_0/OUT2 } ]
set_clock_jitter 0.6 [ get_clocks { PCIe_EP_0/PCIe_TL_CLK_0/CLK_DIV2_0/CLK_DIV2_0/I_CD/Y_DIV } ]
set_clock_jitter 0.15 [ get_clocks { PF_DDR4_SS_0/CCC_0/pll_inst_0/OUT2 } ]
set_clock_jitter 0.135 [ get_clocks { PF_DDR4_SS_0/CCC_0/pll_inst_0/OUT1 } ]
set_clock_jitter 0.15 [ get_clocks { PF_DDR3_SS_0/CCC_0/pll_inst_0/OUT3 } ]
set_clock_jitter 0.135 [ get_clocks { CCC_111MHz_0/CCC_111MHz_0/pll_inst_0/OUT0 } ]
set_clock_jitter 0.135 [ get_clocks { PF_DDR3_SS_0/CCC_0/pll_inst_0/OUT0 } ]
set_clock_jitter 0.6 [ get_clocks { PCIe_EP_0/PCIe_TL_CLK_0/OSC_160MHz_0/OSC_160MHz_0/I_OSC_160/CLK } ]
set_clock_jitter 0.135 [ get_clocks { PCIe_EP_0/PCIe_TX_PLL_0/PCIe_TX_PLL_0/txpll_isnt_0/DIV_CLK } ]
set_clock_jitter 0.0265695 [ get_clocks { REF_CLK_PAD_P } ]
set_clock_jitter 0.135 [ get_clocks { PF_DDR3_SS_0/CCC_0/pll_inst_0/OUT1 } ]
set_clock_jitter 0.0265695 [ get_clocks { REF_CLK_0 } ]
set_clock_groups -name {async} -asynchronous -group [ get_clocks { REF_CLK_0 } ]
set_clock_groups -name {async} -asynchronous -group [ get_clocks { PF_DDR3_SS_0/CCC_0/pll_inst_0/OUT1 } ]
set_clock_groups -name {async} -asynchronous -group [ get_clocks { PF_DDR4_SS_0/CCC_0/pll_inst_0/OUT1 } ]
